import { Component } from '@angular/core';

@Component({
  selector: 'app-ukrainian',
  templateUrl: './ukrainian.component.html',
  styleUrls: ['./ukrainian.component.css']
})
export class UkrainianComponent {

  rules = [
    { number: 1, title: 'Правопис заголовків', description: 'Заголовок пишеться з великої літери, якщо він не є складним технічним терміном.' },
    { number: 2, title: 'Правопис ініціалів та скорочень', description: 'Ініціали та скорочення пишуться з крапкою.' },
    { number: 3, title: 'Правопис великої літери', description: 'Слово починається з великої літери, якщо воно є першим словом у реченні, назвою твору, заголовком тощо.' },
    { number: 4, title: 'Правопис малої літери', description: 'Слово починається з малої літери, якщо воно не є першим словом у реченні, назвою твору, заголовком тощо.' },
    { number: 5, title: 'Правопис імен та прізвищ', description: 'Ім\'я та прізвище пишуться з великої літери.' },
    { number: 6, title: 'Правопис технічних термінів', description: 'Технічні терміни пишуться з великої літери.' },
    { number: 7, title: 'Правопис числівників', description: 'Числівник пишеться словами, якщо він менше 20, тисяча та її кратні пишуться цифрами.' },
    { number: 8, title: 'Правопис складних слів', description: 'Складне слово пишеться разом.' },
    { number: 9, title: 'Правопис розділових знаків', description: 'Після розділових знаків ставиться пробіл.' },
    { number: 10, title: 'Правопис дієслів', description: 'Дієслово пишеться з малої літери, якщо воно не є першим словом у реченні, назвою твору, заголовком тощо.' }
  ]
}
